<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
 <head>
  <title> Laborcache </title>
  <meta name="Generator" content="Editor">
  <meta name="Author" content="ttcp">
  <meta name="Keywords" content="">
  <meta name="Description" content="">
 </head>

 <body>
	<h2> Labor-Cache # I</h2>

	<p><a href=https://das-labor.org>Das LABOR</a> ist ein <a href=http://hackerspaces.org/wiki/Hackerspaces>Hackerspace</a> in Bochum. </p>

	<p>Ein Hackerspace ist ein Ort, an dem gemeinsam gelernt, gebastelt und an Projekten geschraubt, gel&ouml;tet oder programmiert wird. Es gibt regelm&auml;&szlig;ig Vortr&auml;ge und Workshops zu technischen Themen und den Auswirkungen neuer Technik auf Mensch und Gesellschaft.</p>

	<p>Zugegebenerma&szlig;en ist der Nerd-Faktor des durchschnittlichen Hackers noch etwas h&ouml;her als der des Geocachers. Das k&ouml;nnte auch f&uuml;r den Koffeinpegel gelten.
	Um verwandte Seelen anzulocken, planen Mitglieder des LABORs aka Laboranten in n&auml;chster Zeit den einen oder anderen Cache in der n&auml;heren oder weiteren Umgebung der Vereinsr&auml;ume zu plazieren. Dies wird also hoffentlich der erste Cache einer Reihe. Wer beim L&ouml;sen des R&auml;tsels nicht weiterkommt, oder einfach Lust hat, mal vorbeizuschauen, ist herzlich eingeladen. Es ist eigentlich so gut wie jeden Tag ab dem sp&auml;teren Nachmittag jemand da. Wenn auf der <a href=https://das-labor.org>Homepage</a> ein gr&uuml;nes H&auml;kchen zu sehen ist, ist Das LABOR besetzt.
	Wer lieber erstmal virtuell gucken m&ouml;chte, kann sich von der Hompage gerne in unser wiki weiterklicken. Aktuelle und abgeschlossene Projekte sind dokumentiert. Quellcodes sind im svn &ouml;ffentlich zug&auml;nglich. Wer von weither kommt, kann vor seienm Besuch anrufen oder sich &uuml;ber die Mailingliste ank&uuml;ndigen.</p>

	<p>Da Hackerspaces auch international miteinander vernetzt sind, und wir ab und an mal internationalen Besuch haben, haben wir uns entschieden, das R&auml;tsel zur Ermittlung der Cachekoordinaten in englischer Sprache zu verfassen. Da echte Hacker und solche, die es gerne w&auml;ren, sich ohnehin st&auml;ndig mit manpages von Kommandozeilenprogrammen, f***ing manuals und Datenbl&auml;ttern von Halbleiterchips besch&auml;ftigen, wird das kein Problem darstellen. L&ouml;tkolben, Oszilloskop und Multimeter sind zum L&ouml;sen des R&auml;tsels zun&auml;chst nicht erforderlich (Das kann sich bei Folgecaches noch &auml;ndern). Was aber f&uuml;r echte Hacker absolut unerl&auml;&szlig;lich ist, ist ein richtiger Computer. Richtig ist ein Computer erst dann, wenn er zur Bedienung auf allen farbigen Schnickschnack verzichtet und stattdessen mit flinken Fingern per Kommandozeile befehligt wird.</p>

	<p>F&uuml;r den Anfang stellt Das LABOR Dir erstmal einen eigenen Rechner zur Verf&uuml;gung.</p>
	<p>Um die Koordinaten des Caches zu erhalten, <b>Klick' auf den Bildschirm unten, log Dich ein,</b> lerne ein paar n&uuml;tzliche Dinge &uuml;ber *nix, falls Du sie nicht schon l&auml;ngst wei&szlig;t.</p>
	<p>Ach, eins noch ...  Das R&auml;tsel ben&ouml;tigt JavaScript. Es ist bis jetzt erfolgreich getestet mit Firefox 4 + 5, Chrome, Opera 11, Safari 5 und IE9</p>
	<p>Unser Dank geb&uuml;hrt Fabrice Bellard f&uuml;r seinen gro&szlig;artigen Javascript PC Emulator.</p>

	<p>Viel Spa&szlig;.</p>


	<h2>english:</h2>


	<p><a href=https://das-labor.org>Das LABOR</a> is a <a href=http://hackerspaces.org/wiki/Hackerspaces>Hackerspace</a> in Bochum, Germany.</p>

	<p>A hackerspace is a place for learning and tinkering in community with others. Lectures and workshops concerning technological development and its impact on indivdual and society are organized on regular basis.</p>

	<p>Admittedly the nerd factor is above average -- probably even above the nerd factor of the average geocacher. This might also apply to caffeine level.
	To attract like minded individuals some of our members prepare to place a series of caches in the neighbourhood of our domicile. So this one will hopefully be the first in a series. If You should happen to encouter difficulties in solving the riddle or otherwise feel like paying us a visit You are kindly invited to drop in. Almost every Day people can be met in Das LABOR starting from later afternoon. Whenever a green check mark is found on the <a href=https://das-labor.org>Homepage</a> friendly and fascinating persons are present. 
	Who prefers a virtual visit first is encouraged to visit the homepage and click forward to our wiki. Running an finished projects are documented here. Sources are kept in a publicly available svn.
	If You come from abroad give us a call ahead or drop a line on the mailing list.</p>

	<p>Soldering guns, scopes and meters are not required to solve the mystery of this cache (Which may be subject to change in future sequels). A must for each an every true hacker is on the other hand a real computer. What makes a computer real is of course mandatory absence of graphical Chichi in favour of a commandline. For a good start Das LABOR will offer You a computer.</p>
	<p>To obtain the coordinates You will have to <b>just klick on the window below, log in</b> and learn some interesting stuff about *nix if You don't already know.</p>
	<p>Ahmm, one last thing ...  The Riddle makes use of JavaScript. It has up to now been successfully tested on Firefox 4 + 5, Chrome, Opera 11, Safari 5 and IE9</p>
	<p>We thank Fabrice Bellard for his excellent Javascript PC Emulator.</p>

	<p>Enjoy.</p>

	<center>
		<a href="jslinux.htm">
			<img src="terminal.jpg" width="714" height="535" border="0" alt="Login">
		</a>
	</center>
 </body>
</html>
